[
  {
    "id": "one-piece",
    "title": "One Piece",
    "author": "Oda Eiichiro",
    "genres": ["Action", "Adventure", "Shounen", "Comedy", "Drama"],
    "status": "ongoing",
    "total_chapters": 1100,
    "description": "Gol D. Roger was known as the Pirate King, the strongest and most infamous being to have sailed the Grand Line. The capture and death of Roger by the World Government brought a change throughout the world. His last words before his death revealed the location of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece which promises an unlimited amount of riches and fame, and quite possibly the most coveted of titles for the person who found it, the title of the Pirate King.",
    "cover_url": "https://example.com/covers/one-piece.jpg"
  },
  {
    "id": "naruto",
    "title": "Naruto",
    "author": "Kishimoto Masashi",
    "genres": ["Action", "Adventure", "Shounen", "Martial Arts", "Supernatural"],
    "status": "completed",
    "total_chapters": 700,
    "description": "Twelve years ago the Village Hidden in the Leaves was attacked by a fearsome threat. A nine-tailed fox spirit claimed the life of the village leader, the Hokage, and many others. Today, the village is at peace and a troublemaking kid named Naruto is struggling to graduate from Ninja Academy. His goal may be to become the next Hokage, but his true destiny will be much more complicated.",
    "cover_url": "https://example.com/covers/naruto.jpg"
  },
  {
    "id": "attack-on-titan",
    "title": "Attack on Titan",
    "author": "Hajime Isayama",
    "genres": ["Action", "Drama", "Fantasy", "Shounen", "Military"],
    "status": "completed",
    "total_chapters": 139,
    "description": "Several hundred years ago, humans were nearly exterminated by giants. Giants are typically several stories tall, seem to have no intelligence, devour human beings and, worst of all, seem to do it for the pleasure rather than as a food source. A small percentage of humanity survived by walling themselves in a city protected by extremely high walls, even taller than the biggest of giants.",
    "cover_url": "https://example.com/covers/attack-on-titan.jpg"
  },
  {
    "id": "demon-slayer",
    "title": "Demon Slayer: Kimetsu no Yaiba",
    "author": "Gotouge Koyoharu",
    "genres": ["Action", "Shounen", "Supernatural", "Historical"],
    "status": "completed",
    "total_chapters": 205,
    "description": "Since ancient times, rumors have abounded of man-eating demons lurking in the woods. Because of this, the local townsfolk never venture outside at night. Legend has it that a demon slayer also roams the night, hunting down these bloodthirsty demons. For young Tanjirou, these rumors will soon to become his harsh reality.",
    "cover_url": "https://example.com/covers/demon-slayer.jpg"
  },
  {
    "id": "my-hero-academia",
    "title": "My Hero Academia",
    "author": "Horikoshi Kohei",
    "genres": ["Action", "Shounen", "School", "Superhero"],
    "status": "ongoing",
    "total_chapters": 400,
    "description": "In a world where eighty percent of the population has some kind of super-powered Quirk, Izuku was unlucky enough to be born completely normal. But that won't stop him from enrolling in a prestigious hero academy. Now, he'll get his first taste of brutal rivalry from other schools as he braves the cutthroat, no-holds-barred provisional license exam.",
    "cover_url": "https://example.com/covers/my-hero-academia.jpg"
  },
  {
    "id": "death-note",
    "title": "Death Note",
    "author": "Ohba Tsugumi",
    "genres": ["Thriller", "Supernatural", "Psychological", "Shounen"],
    "status": "completed",
    "total_chapters": 108,
    "description": "Yagami Light is an ace student with great prospects, who's bored out of his mind. One day he finds the Death Note, a notebook held by a shinigami (Death God). With the Death Note in hand, Light decides to create a perfect world. A world without crime or criminals. However, when criminals start dropping dead one by one, the authorities send the legendary detective L to track down the killer.",
    "cover_url": "https://example.com/covers/death-note.jpg"
  },
  {
    "id": "fullmetal-alchemist",
    "title": "Fullmetal Alchemist",
    "author": "Arakawa Hiromu",
    "genres": ["Action", "Adventure", "Drama", "Fantasy", "Shounen"],
    "status": "completed",
    "total_chapters": 109,
    "description": "Alchemy is bound by this Law of Equivalent Exchange—something the young brothers Edward and Alphonse Elric only realize after attempting human transmutation: the one forbidden act of alchemy. They pay a terrible price for their transgression—Edward loses his left leg, Alphonse his physical body. It is only by the desperate sacrifice of Edward's right arm that he is able to affix Alphonse's soul to a suit of armor.",
    "cover_url": "https://example.com/covers/fullmetal-alchemist.jpg"
  },
  {
    "id": "dragon-ball",
    "title": "Dragon Ball",
    "author": "Toriyama Akira",
    "genres": ["Action", "Adventure", "Comedy", "Shounen", "Martial Arts"],
    "status": "completed",
    "total_chapters": 519,
    "description": "Son Goku is the greatest hero on Earth. Five years after defeating the demon king Piccolo, he's grown up and has a family. But what is the real reason for Goku's incredible strength? A visitor from outer space arrives bearing terrible news—Goku is an alien, and the visitor, Raditz, is Goku's brother!",
    "cover_url": "https://example.com/covers/dragon-ball.jpg"
  },
  {
    "id": "tokyo-ghoul",
    "title": "Tokyo Ghoul",
    "author": "Ishida Sui",
    "genres": ["Action", "Horror", "Supernatural", "Seinen"],
    "status": "completed",
    "total_chapters": 144,
    "description": "Strange murders are happening in Tokyo. Due to liquid evidence at the scene, the police conclude the attacks are the results of 'eater' type ghouls. College buddies Kaneki and Hide come up with the idea that ghouls are imitating humans so that's why they haven't ever seen one. Little did they know that their theory may very well become reality.",
    "cover_url": "https://example.com/covers/tokyo-ghoul.jpg"
  },
  {
    "id": "hunter-x-hunter",
    "title": "Hunter x Hunter",
    "author": "Togashi Yoshihiro",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "status": "hiatus",
    "total_chapters": 390,
    "description": "Hunters are a special breed, dedicated to tracking down treasures, magical beasts, and even other people. But such pursuits require a license, and less than one in a hundred thousand can pass the grueling qualification exam. Those who do pass gain access to restricted areas, amazing stores of information, and the right to call themselves Hunters.",
    "cover_url": "https://example.com/covers/hunter-x-hunter.jpg"
  },
  {
    "id": "bleach",
    "title": "Bleach",
    "author": "Kubo Tite",
    "genres": ["Action", "Supernatural", "Shounen"],
    "status": "completed",
    "total_chapters": 686,
    "description": "Ichigo Kurosaki is an ordinary high schooler—until his family is attacked by a Hollow, a corrupt spirit that seeks to devour human souls. It is then that he meets a Soul Reaper named Rukia Kuchiki, who gets injured while protecting Ichigo's family from the assailant. To save his family, Ichigo accepts Rukia's offer of taking her powers and becomes a Soul Reaper as a result.",
    "cover_url": "https://example.com/covers/bleach.jpg"
  },
  {
    "id": "jujutsu-kaisen",
    "title": "Jujutsu Kaisen",
    "author": "Akutami Gege",
    "genres": ["Action", "School", "Shounen", "Supernatural"],
    "status": "ongoing",
    "total_chapters": 250,
    "description": "In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the supernatural!",
    "cover_url": "https://example.com/covers/jujutsu-kaisen.jpg"
  },
  {
    "id": "sailor-moon",
    "title": "Sailor Moon",
    "author": "Takeuchi Naoko",
    "genres": ["Action", "Romance", "Shoujo", "Magical Girl"],
    "status": "completed",
    "total_chapters": 60,
    "description": "Usagi Tsukino is a normal girl until she meets up with Luna, a talking cat, who tells her that she is Sailor Moon. As Sailor Moon, Usagi must fight evils and enforce justice, in the name of the Moon and the mysterious Moon Princess. She meets other girls destined to be Sailor Senshi (Sailor Scouts), and together, they fight the forces of evil!",
    "cover_url": "https://example.com/covers/sailor-moon.jpg"
  },
  {
    "id": "cardcaptor-sakura",
    "title": "Cardcaptor Sakura",
    "author": "CLAMP",
    "genres": ["Adventure", "Comedy", "Romance", "Shoujo", "Magical Girl"],
    "status": "completed",
    "total_chapters": 50,
    "description": "Ten-year-old fourth grader Sakura Kinomoto opens a mysterious book in her father's study and accidentally releases the magical Clow Cards. Created by the half-English, half-Chinese sorcerer Clow Reed, the Clow Cards are extremely dangerous if left to roam freely. Guardian of the Clow Cards Cerberus emerges from the book and chooses Sakura to retrieve the missing cards.",
    "cover_url": "https://example.com/covers/cardcaptor-sakura.jpg"
  },
  {
    "id": "fruits-basket",
    "title": "Fruits Basket",
    "author": "Takaya Natsuki",
    "genres": ["Comedy", "Drama", "Romance", "Shoujo", "Slice of Life"],
    "status": "completed",
    "total_chapters": 136,
    "description": "After a family tragedy turns her life upside down, plucky high schooler Tohru Honda takes matters into her own hands and moves out…into a tent! Unfortunately for her, she pitches her new home on private land belonging to the mysterious Sohma clan, and it isn't long before the owners discover her secret. But, as Tohru quickly finds out, the Sohmas have a secret of their own—when hugged by the opposite sex, they turn into the animals of the Chinese Zodiac!",
    "cover_url": "https://example.com/covers/fruits-basket.jpg"
  },
  {
    "id": "akira",
    "title": "Akira",
    "author": "Otomo Katsuhiro",
    "genres": ["Action", "Drama", "Sci-Fi", "Seinen", "Thriller"],
    "status": "completed",
    "total_chapters": 120,
    "description": "The year is 2019. A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psionic psychopath that only two teenagers and a group of psionics can stop. This manga won numerous awards including the Kodansha Manga Award for manga excellence.",
    "cover_url": "https://example.com/covers/akira.jpg"
  },
  {
    "id": "ghost-in-the-shell",
    "title": "Ghost in the Shell",
    "author": "Shirow Masamune",
    "genres": ["Action", "Sci-Fi", "Seinen"],
    "status": "completed",
    "total_chapters": 64,
    "description": "In the 21st century, mankind has expanded into space, cyborgs are commonplace, and the internet has become a vast electronic network. Major Motoko Kusanagi, an enhanced cyborg policewoman, hunts the criminal known as 'The Puppetmaster'. This futuristic tale is a complex examination of humanity and the soul.",
    "cover_url": "https://example.com/covers/ghost-in-the-shell.jpg"
  },
  {
    "id": "berserk",
    "title": "Berserk",
    "author": "Miura Kentaro",
    "genres": ["Action", "Adventure", "Drama", "Fantasy", "Horror", "Seinen"],
    "status": "ongoing",
    "total_chapters": 374,
    "description": "Guts, a former mercenary now known as the 'Black Swordsman,' is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the sake of his own ambitions. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings.",
    "cover_url": "https://example.com/covers/berserk.jpg"
  },
  {
    "id": "monster",
    "title": "Monster",
    "author": "Urasawa Naoki",
    "genres": ["Drama", "Mystery", "Psychological", "Seinen", "Thriller"],
    "status": "completed",
    "total_chapters": 162,
    "description": "Dr. Kenzo Tenma is a brilliant neurosurgeon with a bright future ahead of him. He is worshiped by his peers as a genius and praised by his superiors for his incredible surgical skills, earning him a gorgeous fiancee and a promising career at the hospital. But everything changes when a mysterious young boy and his twin sister are rushed into the hospital after a brutal attack.",
    "cover_url": "https://example.com/covers/monster.jpg"
  },
  {
    "id": "vinland-saga",
    "title": "Vinland Saga",
    "author": "Yukimura Makoto",
    "genres": ["Action", "Adventure", "Drama", "Historical", "Seinen"],
    "status": "ongoing",
    "total_chapters": 200,
    "description": "As a child, Thorfinn sat at the feet of the great Leif Ericson and thrilled to wild tales of a land far to the west. But his youthful fantasies were shattered by a mercenary raid. Raised by the Vikings who murdered his family, Thorfinn became a terrifying warrior, forever seeking to kill the band's leader, Askeladd, and avenge his father. Sustaining Thorfinn through his ordeal are his pride in his family and his dreams of a fertile westward land, a land without war or slavery...the land Leif called Vinland.",
    "cover_url": "https://example.com/covers/vinland-saga.jpg"
  },
  {
    "id": "spy-x-family",
    "title": "Spy x Family",
    "author": "Endo Tatsuya",
    "genres": ["Action", "Comedy", "Family", "Shounen", "Slice of Life"],
    "status": "ongoing",
    "total_chapters": 95,
    "description": "Master spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment—to get married and have a child—he may finally be in over his head! Not one to depend on others, Twilight has his work cut out for him procuring both a wife and a child for his mission to infiltrate an elite private school.",
    "cover_url": "https://example.com/covers/spy-x-family.jpg"
  },
  {
    "id": "chainsaw-man",
    "title": "Chainsaw Man",
    "author": "Fujimoto Tatsuki",
    "genres": ["Action", "Horror", "Shounen", "Supernatural"],
    "status": "ongoing",
    "total_chapters": 97,
    "description": "Denji's a poor young man who'll do anything for a bit of cash, even hunting down devils with his pet devil-dog Pochita. He's a simple man with simple dreams, drowning under a mountain of debt. But his sad life gets turned upside down one day when he's betrayed by someone he trusts. Now with the power of a devil inside him, Denji's become a whole new man—Chainsaw Man!",
    "cover_url": "https://example.com/covers/chainsaw-man.jpg"
  },
  {
    "id": "your-name",
    "title": "Your Name",
    "author": "Kotone Ranmaru",
    "genres": ["Drama", "Romance", "Shounen", "Supernatural"],
    "status": "completed",
    "total_chapters": 9,
    "description": "Based on the hit animated film. Mitsuha, a high school girl living in a small town in the mountains, has a dream that she's a boy living in Tokyo. Taki, a high school boy in Tokyo, dreams he's a girl living in a quaint town. Sharing bodies, relationships, and lives, the two become inextricably interwoven—but are any connections truly inseverable?",
    "cover_url": "https://example.com/covers/your-name.jpg"
  },
  {
    "id": "haikyuu",
    "title": "Haikyuu!!",
    "author": "Furudate Haruichi",
    "genres": ["Comedy", "Drama", "School", "Shounen", "Sports"],
    "status": "completed",
    "total_chapters": 402,
    "description": "After losing his first and last volleyball match against Tobio Kageyama, 'the King of the Court,' Shoyo Hinata swears to become his rival after graduating middle school. But what happens when the guy he wants to defeat ends up being his teammate?",
    "cover_url": "https://example.com/covers/haikyuu.jpg"
  },
  {
    "id": "kaguya-sama",
    "title": "Kaguya-sama: Love is War",
    "author": "Akasaka Aka",
    "genres": ["Comedy", "Romance", "School", "Seinen", "Slice of Life"],
    "status": "completed",
    "total_chapters": 281,
    "description": "As leaders of their prestigious academy's student council, Kaguya and Miyuki are the elite of the elite! But it's lonely at the top... Luckily for them, they've fallen in love! There's just one problem—they both have too much pride to admit it. And so begins the daily war of love, where one must induce the other to confess their romantic feelings first!",
    "cover_url": "https://example.com/covers/kaguya-sama.jpg"
  },
  {
    "id": "mob-psycho-100",
    "title": "Mob Psycho 100",
    "author": "ONE",
    "genres": ["Action", "Comedy", "School", "Shounen", "Supernatural"],
    "status": "completed",
    "total_chapters": 101,
    "description": "Kageyama Shigeo (nicknamed Mob) is a 8th grader with psychic abilities. He could bend spoons and lift objects with his mind from a young age, but he slowly began to withhold from using his abilities in public due to the negative attention he kept receiving. Now, the only thing he wants is to become friends with a girl in his class, Tsubomi. With his psychic powers repressed, Mob's only outlet for his energy is to improve his physical health by joining his school's Body Improvement Club.",
    "cover_url": "https://example.com/covers/mob-psycho-100.jpg"
  },
  {
    "id": "violet-evergarden",
    "title": "Violet Evergarden",
    "author": "Akatsuki Kana",
    "genres": ["Drama", "Fantasy", "Josei", "Military", "Slice of Life"],
    "status": "completed",
    "total_chapters": 13,
    "description": "The Great War finally came to an end after four long years of conflict; fractured in two, the continent of Telesis slowly began to flourish once again. Caught up in the bloodshed was Violet Evergarden, a young girl raised for the sole purpose of decimating enemy lines. Hospitalized and maimed in a bloody skirmish during the War's final leg, she was left with only words from the person she held dearest, but with no understanding of their meaning.",
    "cover_url": "https://example.com/covers/violet-evergarden.jpg"
  },
  {
    "id": "blue-lock",
    "title": "Blue Lock",
    "author": "Muneyuki Kaneshiro",
    "genres": ["Drama", "School", "Shounen", "Sports"],
    "status": "ongoing",
    "total_chapters": 250,
    "description": "After a disastrous defeat at the 2018 World Cup, Japan's team struggles to regroup. But what's missing? An absolute Ace Striker, who can guide them to the win. The Japan Football Union is hell-bent on creating a striker who hungers for goals and thirsts for victory, and who can be the decisive instrument in turning around a losing match...and to do so, they've gathered 300 of Japan's best and brightest youth players. Who will emerge to lead the team...and will they be able to out-muscle and out-ego everyone who stands in their way?",
    "cover_url": "https://example.com/covers/blue-lock.jpg"
  },
  {
    "id": "promised-neverland",
    "title": "The Promised Neverland",
    "author": "Kaiu Shirai",
    "genres": ["Drama", "Horror", "Mystery", "Shounen", "Thriller"],
    "status": "completed",
    "total_chapters": 181,
    "description": "Emma, Norman and Ray are the brightest kids at the Grace Field House orphanage. And under the care of the woman they refer to as 'Mom,' all the kids have enjoyed a comfortable life. Good food, clean clothes and the perfect environment to learn—what more could an orphan ask for? One day, though, Emma and Norman uncover the dark truth of the outside world they are forbidden from seeing.",
    "cover_url": "https://example.com/covers/promised-neverland.jpg"
  },
  {
    "id": "weathering-with-you",
    "title": "Weathering With You",
    "author": "Kubota Watari",
    "genres": ["Drama", "Romance", "Shounen", "Supernatural"],
    "status": "completed",
    "total_chapters": 16,
    "description": "High school student Hodaka leaves his home on an isolated island and moves to Tokyo, but he immediately becomes broke! He lives his days in isolation, but finally finds work as a writer for a mysterious occult magazine. Then one day, Hodaka meets Hina on a busy street corner. This bright and strong-willed girl possesses a strange and wonderful ability: the power to stop the rain and clear the sky...",
    "cover_url": "https://example.com/covers/weathering-with-you.jpg"
  }
]
